<?php

$helfencontact = "
  <b>  راهنمای ارسال کانتکت (شماره مخاطب):</b>

برای اینکه بتونیم مخاطب خاصت رو پیدا کنیم، باید شماره تلفنش رو به ربات ارسال کنی. در ادامه نحوه انجام این کار رو توضیح میدم:

<b>1️⃣ روش اول : از لیست مخاطبین:</b>

وارد صفحه چت با ربات بشو.

روی آیکون 'گیره کاغذ' 📎 (یا مشابه آن در تلگرام) کلیک کن.

گزینه 'Contact' 📞 (مخاطب) رو انتخاب کن.

مخاطبی که می‌خوای بهش پیام ناشناس بدی رو از لیست انتخاب کن و ارسال کن.

<b>2️⃣ روش دوم : از طریق صفحه چت با مخاطب:</b>

وارد چت با مخاطب خاصت در تلگرام بشو.

روی شماره یا اسم مخاطب کلیک کن.

در قسمت 'More' یا 'بیشتر'، گزینه 'Share Contact' یا 'ارسال شماره' رو پیدا کن و به ربات فوروارد کن.

🔸 <b>نکته مهم:</b> اطمینان حاصل کن که مخاطبت دسترسی به بات‌ها رو از طریق تنظیمات تلگرام نبسته باشه. اگر این کار رو انجام داده باشه، ربات نمی‌تونه اطلاعات حسابش رو ببینه و وصل بشه.

🔸 <b>توجه:</b> اگر هنوز موفق نشدی، می‌تونی از روش‌های دیگه مثل ارسال آیدی عددی یا یوزرنیم استفاده کنی.
";

bot::sendMessage($fromID, $helfencontact, $message_id);
